final/frontend/views/sjfx/price.php

                },
                data: [<?php
                $query2=SjfxGasprice::find();
                $gasprice=$query2->orderBy('date')->all();
---
SELECT * FROM `sjfx_gasprice` ORDER BY `date`

                data: [
                <?php
                $query1=SjfxPetrolprice::find();
                $petrolprice=$query1->orderBy('date')->all();
---
SELECT * FROM `sjfx_petrolprice` ORDER BY `date`

                type: "bar",
                data: [<?php
                $query1=SjfxPetrolprice::find();
                $petrolprice=$query1->orderBy('date')->all();
---
SELECT * FROM `sjfx_petrolprice` ORDER BY `date`

                type: "bar",
                data: [<?php
                $query1=SjfxPetrolprice::find();
                $petrolprice=$query1->orderBy('date')->all();
---
SELECT * FROM `sjfx_petrolprice` ORDER BY `date`

                yAxisIndex: 1,
                data: [<?php
                $query1=SjfxPetrolprice::find();
                $petrolprice=$query1->orderBy('date')->all();
---
SELECT * FROM `sjfx_petrolprice` ORDER BY `date`

                yAxisIndex: 1,
                data: [<?php
                $query1=SjfxPetrolprice::find();
                $petrolprice=$query1->orderBy('date')->all();
---
SELECT * FROM `sjfx_petrolprice` ORDER BY `date`