jtj/yii2022/common/models/Tag.php

SELECT * FROM `tag` ORDER BY `frequency` DESC LIMIT 20
SELECT COUNT(*) FROM `tag`
---
    public static function findTagWeights($limit=20)
    {
    	$tag_size_level = 5;

    	$models=Tag::find()->orderBy('frequency desc')->limit($limit)->all();
    	$total=Tag::find()->limit($limit)->count();