final/frontend/views/layouts/main2.php

SELECT * FROM `user` WHERE `username`='user'
---
                <?php
                if(!Yii::$app->user->isGuest)
                {
                  $user=User::find()->where(['username'=>Yii::$app->user->identity->username])->one();

SELECT * FROM `developer` WHERE `id`=1
---
                <img src="newmain/img/team/jtj.jpg" alt="Client Testimonoal" />
                <div class="testimonial-text">
                  <p><?php
                      $t = Developer::find()->where(['id'=>1])->one();

SELECT * FROM `developer` WHERE `id`=4
---
                <img src="newmain/img/team/yzh.jpg" alt="Client Testimonoal" />
                <div class="testimonial-text">
                  <p><?php
                      $t = Developer::find()->where(['id'=>4])->one();

SELECT * FROM `developer` WHERE `id`=3
---
                <img src="newmain/img/team/wtp.jpg" alt="Client Testimonoal" />
                <div class="testimonial-text">
                  <p><?php
                      $t = Developer::find()->where(['id'=>3])->one();

SELECT * FROM `developer` WHERE `id`=2
---
                <img src="newmain/img/team/zjs.jpg" alt="Client Testimonoal" />
                <div class="testimonial-text">
                  <p><?php
                      $t = Developer::find()->where(['id'=>2])->one();