jtj/yii2022/frontend/controllers/PostController.php

    protected function findModel($id)
    {
        if (($model = Post::findOne($id)) !== null) {
---
SELECT * FROM `post` WHERE `id`='32'

    public function actionDetail($id)
    {
    	//step1. 准备数据模型
    	$model = $this->findModel($id);
    	$tags=Tag::findTagWeights();
    	$recentComments=Comment::findRecentComments();

    	$userMe = User::findOne(Yii::$app->user->id);
---
SELECT * FROM `user` WHERE `id` IS NULL