jtj/yii2022/frontend/views/layouts/main2.php

                <?php
                if(!Yii::$app->user->isGuest)
                {
                  $user=User::find()->where(['username'=>Yii::$app->user->identity->username])->one();
---
SELECT * FROM `user` WHERE `username`='user'

                <img src="newmain/img/testimonial/customer1.jpg" alt="Client Testimonoal" />
                <div class="testimonial-text">
                  <p><?php
                      $t = Developer::find()->where(['id'=>1])->one();
---
SELECT * FROM `developer` WHERE `id`=1

                <img src="newmain/img/testimonial/customer2.jpg" alt="Client Testimonoal" />
                <div class="testimonial-text">
                  <p><?php
                      $t = Developer::find()->where(['id'=>4])->one();
---
SELECT * FROM `developer` WHERE `id`=4

                <img src="newmain/img/testimonial/customer3.jpg" alt="Client Testimonoal" />
                <div class="testimonial-text">
                  <p><?php
                      $t = Developer::find()->where(['id'=>3])->one();
---
SELECT * FROM `developer` WHERE `id`=3

                <img src="newmain/img/testimonial/customer4.jpg" alt="Client Testimonoal" />
                <div class="testimonial-text">
                  <p><?php
                      $t = Developer::find()->where(['id'=>2])->one();
---
SELECT * FROM `developer` WHERE `id`=2